{"2021-04-28T00:00:00+00:00": "\nVirtual Day 1\n\nEarly Dismissals\nBoys Varsity Tennis: 11:40am\nBoys Varsity Volleyball: 12:45pm\nVarsity Baseball: 12:30pm\nBoys JV Baseball: 1:00pm\nVarsity Softball: 1:15pm\nBoys JV Tennis: 2:00pm\nGirls FS Soccer: 1:30pm\n\nAthletics\nA huge Shout Out to our 7-0, Varsity Eagle Golfers for their great win against Orange Lutheran at Black Gold Golf Course. The Eagles were led by Medalist Jade Zamora shooting an impressive even Par score of 36. Other great scores came from Maya Robilio, Katie Redd, Jennifer Hu and Ashley Kim. Next up JSerra at Coto de Caza on Thursday! Go Eagles!!\n\nActivities\nThursday, April 29 (non-uniform): 1000 Island. Wear school appropriate Hawaiian shirts.*\nFriday, April 30 (non-uniform): House. Wear your SM Class T-Shirt.*\n\n*Must be worn with pants or shorts with at least a 6” inseam. Yoga pant/leggings/jeggings may only be worn with a shirt length that reaches your thumb when arms are extended down on your side. Footwear must be closed toe/closed heel. No hats allowed.\nHappy Birthday to: Alexander Kashkarian, Davin Maas, Eugenio Navarro Quiros, Genalyn Norton, and Olivia Pearlman!\n", "2021-04-29T00:00:00+00:00": "\nSpecial Schedule Day 1\nLunch revolves around your period 3 class.\n\nEarly Dismissals\nGirls Varsity Tennis- 11:40am\nGirls Varsity Golf- 1:00pm\nBoys Swimming- 2:00pm\n\nActivities\nThursday, April 29 (non-uniform): 1000 Island. Wear school appropriate Hawaiian shirts with pants or shorts with at least a 6” inseam. Yoga pant/leggings/jeggings may only be worn with a shirt length that reaches your thumb when arms are extended down on your side. Footwear must be closed toe/closed heel. No hats allowed.\nFriday, April 30 (non-uniform): House. Wear your SM Class T-Shirt with pants or shorts with at least a 6” inseam. Yoga pant/leggings/jeggings may only be worn with a shirt length that reaches your thumb when arms are extended down on your side. Footwear must be closed toe/closed heel. No hats allowed.\nHappy Birthday to: Haley Dodd, Jackson Giraudi, and Nathan Rilko!\n", "2021-05-03T00:00:00+00:00": "\nRegular Day 7\nLunch revolves around your period 2 class\nAthletics\nCongratulations to the Dance Team for taking home the 1st place National Championship title over the weekend for their Large Lyrical routine. The team also placed 2nd in all three of their other dance divisions at Nationals. Congratulations to sophomore soloist, Janna Redmond for taking home 3rd place.\n\nCongrats to JV Song for winning a National title in the JV Jazz division at USA Spirit Nationals this past weekend! The team was undefeated all season! Way to go ladies!\n\nActivities\nAttention Seniors! Senior Prom and Cruise tickets go on sale today at 3:00pm! Check your campus life team for more information.\nAttention Juniors! Junior Prom tickets are on sale now! Check your campus life team for the link to purchase. Ticket prices go up on May 6 at 3:00pm!\n\nHappy Birthday over the weekend to: Austin Cheng, Jack Collins, Mingyi Dai, Brandon Lewis, Reymello Murphy, Monica Koh, John Mulvee, and Max Roop!\nHappy Birthday today to: Katherine Eli, Sabah Kakar, Martin Rottach, Drew Rutter, and Thomas Straub!\n", "2021-05-04T00:00:00+00:00": "\nMeeting Day 4\nLunch revolves around your period 5 class\n\nActivities\nAttention Juniors! Junior Prom tickets are on sale now! Check your campus life team for the link to purchase. Ticket prices go up on May 6 at 3:00pm!\nAttention Seniors! Tickets for the May 26, 2021 Senior Prom and Cruise are sold out. We are actively working to accommodate the SMCHS senior class - please continue to check the 2021 Student Page and your Campus Life Team for up to date information.\n \nHappy Birthday to: Jeffery Bell, Aidan Downey, Jacob Lee, Jacob McDermott, and Joshua McDermott!\n", "2021-05-06T00:00:00+00:00": "\nSpecial Schedule Day 7\nLunch revolves around your period 1 class.\n\nNote: Tomorrow is a Regular Day 3 – classes begin at 8:00am\n\nAthletics:\nA huge CONGRATULATIONS to our 9-0 Varsity Lady Eagle Golfers with their Victory against JSerra at their home course of Arroyo Trabuco Golf Club, 195-211.  The Eagles shot a low Team Score of 195 to the Lions 211. The Eagles were led by Medalist, Senior and Sacred Heart University commit, Maya Robilio shooting even Par 36.  Other Team low scores came from Jade Zamora, Ryan Bullock, Jennifer Hu and Nicole Chang!! Our Lady Golfers are Always Making It A Great Day To Be An Eagle and look forward to a challenging match against Mater Dei this upcoming Thursday at Coto  de Caza!! Stay Tuned……..\n\nCongratulations to the boys and girls swim teams for defeating Mater Dei on Tuesday.  Swimmers of the Meet were Abby Isaly, Mirabella LeVine, Abby O'Sullivan, Nicholas Burke and Keller Morgan.\n\nCongratulations to the newly-elected Talon Theatre Thespian Officers for 21/22 ! Olivia Orellana, Lizzie Bork, Ethan Diaz, Brennan McMahon, Delaney Jankanish, Sophie Pennell, Delaney Giraudi, Maggie Thilken, Sarah Clarke, Annie Mulvihill, Maya Daniels and Thomas Rawlings! It's going to be a great year in Talon Theatre!\n\nArts\nThe Talon Theatre IB Theatre Seniors present CURTAIN CALL on Thursday, May 6th at 8:00 p.m. in the black box. Don't miss this farewell performance featuring favorite musical theatre songs and production numbers from shows not previously performed. Admission is free!\n\nHappy Birthday to: Helen Cueyoung Lee, Molly MacMillan, and Kilian O’Connor!\n", "2021-05-07T00:00:00+00:00": "\nRegular Day 3\nLunch revolves around your period 5 class\n\nAthletics\nCongratulations to Bianca Molnar for winning the Trinity League Tennis Singles Championship yesterday.  Bianca defeated Grace McSkimming of Mater Dei 6-2, and  6-4!\n\nCongratulations to our boys and girls track and field team for beating Servite and Rosary yesterday, moving to 2-0 on the season! This was the first boys win over Servite since 2016. They were led by double winners, Derek Wilkins, Jalen Jones, and Zac Gibson, en route to an 80-51 victory; while the girls were led by a whole host of Eagle winners, including Lidia Major winning both hurdles, as the Eagles won 101-26. The next league meet will be at Mater Dei next Thursday, good luck Eagles!\n\nA HUGE shout out to our 10-0 Lady Eagle Golfers with their Victory today vs Mater Dei at Coto de Caza/South Course. The Eagles had a low team score of 202-209. The Medalist was again our Senior and Sacred Heart University commit, Maya Robilio shooting a low 38. Overall, it was an exciting and competitive match. Next up will be our final League match vs. Rosary on Monday at Tijeras Creek. Then its on to League finals and CIF…..Go Eagles!!\nHappy Birthday to: Tyler Ankrum, Shenghao Dai, Ragan Edwards, Sydney Oducado, Miranda Riley, and Charity Robinson!\n", "2021-05-10T00:00:00+00:00": "\nRegular Day 6\nLunch revolves around your period 1 class\n\nActivities\nAttention Juniors! There are still tickets left for the 2021 Junior Prom at Franciscan Gardens on May 21! Ticket sales close this Friday, May 14 at 3:00pm.\nHappy Birthday Over the Weekend to: Dylan Kaye, Kevin Mahoney, John Rupp, and Kayla Scopaz!\nHappy Birthday Today to: Syncere Bracket, Matthew de Leon, Ava Exceen, Yueshan Gu, Stephanie Howhannesian, Lucas Marshall, LeVar Talley, Sophia Villarreal, and Sirun Yu!\n", "2021-05-11T00:00:00+00:00": "\nMeeting Day 3\nLunch revolves around your period 4 class\n\nActivities\nAttention Juniors and Seniors! The online stores to purchase Prom tickets will close this Friday, May 14 at 3:00pm! You must purchase tickets or have a parent request a refund if you are no longer able to attend prior to the online store closing.\nAthletics\nA Huge shout out to our Lady Eagle Golfers with their win against Rosary at Tijeras Creek Golf Course. The Score was SMCHS 191-Rosary 252, and the Medalists were SMCHS Sr Maya Robilio and Soph Ryan Bullock, both shooting even par scores of 36. Other low scores were from Nicole Chang, Ashley Kim and Jade Zamora. This amazing Team is now Back-To-Back , Undefeated, Trinity League Champions!! Next up is Trinity League Individual Finals….stay tuned!!\n\nHappy Birthday to: Brock Devlin, Liang Fang, and Alyssa Gardarian!\n", "2021-05-13T00:00:00+00:00": "\nRegular Day 6\nLunch revolves around your period 1 class.\nAthletics\nCongratulations to the girls swim team for defeating Woodbridge on all levels on Tuesday.  Swimmers of the Meet were Izzie Abrajan, Ellie Davis and Lena Li.  On the boys' side, swimmers of the meet were Tony Ju, Humberto Najera, Jack Nugent and Daniel Verdolaga.\nActivities\nAttention Juniors and Seniors! Tomorrow, May 14, is the last day to purchase a ticket for Prom or request a refund. Check your campus life teams for the link to purchase a ticket!\nHappy Birthday to: Lucy Donchess, Bethany Glick, Connor Murphy, Lukas Newman, William Privette, and Yianni Tsatsoulis!\n", "2021-05-14T00:00:00+00:00": "\nMeeting Day 3 | Last day of school for the Class of 2021\nLunch revolves around your period 4 class\nAthletics\nCongratulations to our boys and girls track and field teams for beating Mater Dei yesterday on the road. The boys meet came down to the 4x4 with the Eagles prevailing  and defeating the Monarchs, 71-64. The girls handled business and came out with the win, 70-42. Both teams are undefeated with one league meet left to go next Thursday at home against Orange Lutheran.\nCongratulations to the boys and girls swim teams for defeating Rosary and Servite on all levels yesterday.  Swimmers of the Meet were Lindsay Ervin, Mary Tracy, Allen Cai and Jack McHenry.\n\nActivities\nAttention Juniors and Seniors! Today is the last day to purchase a ticket to Prom. Ticket sales will close at 3:00pm today. The link to purchase a ticket can be found in your campus life team!\nHappy Birthday to: Travis James and Jackson Kopeny!\n"}